load-test-results-20251120-163908/API_Gateway_Health.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api-gateway-3daykcsw5a-ew.a.run.app (be patient).....done


Server Software:        Google
Server Hostname:        api-gateway-3daykcsw5a-ew.a.run.app
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api-gateway-3daykcsw5a-ew.a.run.app

Document Path:          /actuator/health
Document Length:        15 bytes

Concurrency Level:      5
Time taken for tests:   18.161 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      49004 bytes
HTML transferred:       1500 bytes
Requests per second:    5.51 [#/sec] (mean)
Time per request:       908.047 [ms] (mean)
Time per request:       181.609 [ms] (mean, across all concurrent requests)
Transfer rate:          2.64 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      219  644 282.4    551    1640
Processing:   144  229 103.7    195     821
Waiting:      144  224 101.7    194     821
Total:        401  873 306.6    769    1889

Percentage of the requests served within a certain time (ms)
  50%    769
  66%    861
  75%    974
  80%   1050
  90%   1338
  95%   1659
  98%   1865
  99%   1889
 100%   1889 (longest request)