load-test-results-20251120-163908/API_Gateway_Public.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api-gateway-3daykcsw5a-ew.a.run.app (be patient).....done


Server Software:        Google
Server Hostname:        api-gateway-3daykcsw5a-ew.a.run.app
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api-gateway-3daykcsw5a-ew.a.run.app

Document Path:          /actuator/info
Document Length:        129 bytes

Concurrency Level:      5
Time taken for tests:   14.371 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      58408 bytes
HTML transferred:       12900 bytes
Requests per second:    6.96 [#/sec] (mean)
Time per request:       718.550 [ms] (mean)
Time per request:       143.710 [ms] (mean, across all concurrent requests)
Transfer rate:          3.97 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      226  487  99.3    474     814
Processing:   138  181  29.4    178     333
Waiting:      137  178  29.3    173     328
Total:        390  668 102.2    659     999

Percentage of the requests served within a certain time (ms)
  50%    659
  66%    685
  75%    716
  80%    726
  90%    797
  95%    855
  98%    994
  99%    999
 100%    999 (longest request)