load-test-results-20251120-163908/User_Service_Health.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking user-service-3daykcsw5a-ew.a.run.app (be patient).....done


Server Software:        Google
Server Hostname:        user-service-3daykcsw5a-ew.a.run.app
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        user-service-3daykcsw5a-ew.a.run.app

Document Path:          /actuator/health
Document Length:        429 bytes

Concurrency Level:      5
Time taken for tests:   16.226 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      87200 bytes
HTML transferred:       42900 bytes
Requests per second:    6.16 [#/sec] (mean)
Time per request:       811.277 [ms] (mean)
Time per request:       162.255 [ms] (mean, across all concurrent requests)
Transfer rate:          5.25 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      195  543 158.4    496     918
Processing:   141  198  47.9    184     381
Waiting:      140  194  47.9    181     381
Total:        343  741 190.3    686    1299

Percentage of the requests served within a certain time (ms)
  50%    686
  66%    765
  75%    845
  80%    928
  90%   1040
  95%   1132
  98%   1202
  99%   1299
 100%   1299 (longest request)